0Bu/daikin-altherma-esp32/main/http_config.cpp
// Explicit HomeHub discovery for the edit dialog. This is intentionally NOT part of boot or of the
// Modbus poll task, and it does not save anything: the user sees the found IPv4 in the normal host
// field and decides with Save or Cancel whether it becomes configuration. A bounded miss returns
// control to that same field for manual entry.
static esp_err_t discover_homehub_now(httpd_req_t* req) {
    if (!wifi_info().connected)
        return send_err(req, "400 Bad Request", "WiFi not connected");
    std::string found;
    if (!mb_discover_homehub(found))
        return send_err(req, "404 Not Found", "No HomeHub found");
    // mb_discover_homehub returns a numeric IPv4 assembled by firmware, never caller text.
    const std::string body = std::string("{\"ok\":true,\"host\":\"") + found + "\"}";
    return http_send_json(req, body.c_str());
}

static esp_err_t set_syslog(httpd_req_t* req) {
    char body[512];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string host = js(j, "host");
    int port = ji(j, "port", 514);
    cJSON_Delete(j);

    // Only the port range is validated synchronously (cheap). DNS resolution + reachability are done
    // asynchronously by the syslog task and surfaced via /status.syslog {resolved, reachable, error},
    // so the request path never blocks on a network probe. (/set_mqtt is the deliberate exception: it
    // pre-flights the broker connect synchronously so a bad address/credential is rejected at Save
    // rather than silently failing after the reboot — syslog is fire-and-forget UDP, MQTT is not.)
    if (!host.empty() && (port < 1 || port > 65535)) {
        httpd_resp_set_status(req, "400 Bad Request");
        return http_send_json(req, "{\"ok\":false,\"error\":\"port out of range\"}");
    }

    Config c = config();
    // Unchanged settings short-circuit — no NVS write, no reboot — exactly like /set_mqtt and
    // /set_ntp. A re-save of the same host/port would otherwise persist identical values and reboot,
    // dropping the poll cycle, MQTT availability and any open WebSocket for nothing. The UI already
    // handles {"reboot":false} (www/js/settings.js "No changes"). /set_wifi is deliberately NOT short-circuited:
    // a re-save there re-arms the credential-rollback trial.
    if (host == c.syslog_host && port == c.syslog_port)
        return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.syslog_host = host;
    c.syslog_port = port;
    if (!config_save(c)) {
        httpd_resp_set_status(req, "500 Internal Server Error");
        return http_send_json(req, "{\"ok\":false,\"error\":\"config write failed\"}");
    }
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_ntp {server} -> persist + reboot, mirroring /set_syslog: no request-path network probe
// (the SNTP client resolves + retries on its own task after reboot), an empty server is accepted —
// config_load() reads it as "reset to the CONFIG_DAIKIN_NTP_SERVER compile-time default" — and the
// only validation here is the same shape a hostname/IP field ever gets in this codebase (none; the
// SNTP client itself just fails to resolve a garbage name and keeps retrying, same as a bad syslog
// host does today).
static esp_err_t set_ntp(httpd_req_t* req) {
    char body[256];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string server = js(j, "server");
    cJSON_Delete(j);

    Config c = config();
    if (server == c.ntp_server) return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.ntp_server = server;
    if (!config_save(c)) {
        httpd_resp_set_status(req, "500 Internal Server Error");
        return http_send_json(req, "{\"ok\":false,\"error\":\"config write failed\"}");
    }
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_weather {latitude, longitude}. Two empty strings disable weather traffic; otherwise both
// strict decimal coordinates are required. Saving is local and non-blocking: the dedicated weather
// task performs TLS/DNS/JSON work only after this response.
static esp_err_t set_weather(httpd_req_t* req) {
    char body[192];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    const std::string latitude = js(j, "latitude");
    const std::string longitude = js(j, "longitude");
    cJSON_Delete(j);
    const WeatherLocationParse location = weather_location_parse(latitude, longitude);
    if (!location.valid) {
        if (std::strcmp(location.reason, "both_coordinates_required") == 0)
            return send_err(req, "400 Bad Request", "latitude and longitude are both required");
        if (std::strcmp(location.reason, "invalid_latitude") == 0)
            return send_err(req, "400 Bad Request", "latitude must be between -90 and 90");
        return send_err(req, "400 Bad Request", "longitude must be between -180 and 180");
    }
    Config c = config();
    const bool weather_was_enabled = c.weather_enabled;
    if (location.enabled == c.weather_enabled &&
        location.latitude_e6 == c.weather_latitude_e6 &&
        location.longitude_e6 == c.weather_longitude_e6)
        return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.weather_enabled = location.enabled;
    c.weather_latitude_e6 = location.latitude_e6;
    c.weather_longitude_e6 = location.longitude_e6;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    if (weather_was_enabled && !location.enabled) mqtt_request_weather_cleanup();
    weather_forecast_reconfigure();
    return http_send_json(req, "{\"ok\":true,\"reboot\":false,\"saved\":true}");
}

