0Bu/daikin-altherma-esp32/main/http_config.cpp
// POST /set_board {preset_id, led_gpio, led_type, led_inverted, btn_gpio, btn_active_low}
// -> validate + persist
// + reboot. This is the board's own hardware — which pin the status indicator is on, whether it is a
// plain LED or a WS2812, and which pin (if any) carries the factory-reset button — kept in NVS
// rather than Kconfig so ONE published image serves boards that disagree about their onboard parts.
//
// Unlike /set_hp (which applies pins live), this REBOOTS. Both settings are claimed once at task
// start: the indicator opens an RMT channel for a WS2812, the button installs a pull on its pin.
// Hot-swapping either means tearing down a running driver from a different task while it blinks —
// a whole class of failure bought for nothing, since changing an indicator pin is a once-per-board
// action. A reboot is also what the four service endpoints already do, so the UI path is identical.
static esp_err_t set_board(httpd_req_t* req) {
    char body[512];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    const Config& cur = config();
    Config c = cur;
    c.led_gpio       = ji(j, "led_gpio", c.led_gpio);
    c.led_type       = ji(j, "led_type", c.led_type);
    c.led_inverted   = jb(j, "led_inverted", c.led_inverted);
    c.btn_gpio       = ji(j, "btn_gpio", c.btn_gpio);
    c.btn_active_low = jb(j, "btn_active_low", c.btn_active_low);
    cJSON* preset_item = cJSON_GetObjectItem(j, "preset_id");
    if (preset_item && !cJSON_IsString(preset_item)) {
        cJSON_Delete(j);
        return send_err(req, "400 Bad Request", "preset_id must be a string");
    }
    const bool preset_sent = preset_item != nullptr;
    const std::string preset_key = preset_sent ? preset_item->valuestring : "";
    cJSON_Delete(j);
    // Submitting this form is an explicit board statement. Current clients send the stable key;
    // for a pre-v12 cached UI, recover the same exact-match choice once and persist it explicitly.
    c.board_user_set = true;
    if (!preset_sent) {
        c.board_preset_id = board_legacy_preset_id(c);
    } else if (preset_key == "custom") {
        c.board_preset_id = BoardPresetId::Custom;
    } else {
        const BoardPreset* preset = board_preset_by_key(preset_key);
        if (!preset) return send_err(req, "400 Bad Request", "board preset is unknown");
        c.board_preset_id = preset->id;
    }

    std::string reason;
    if (!board_identity_valid(c, reason))
        return send_err(req, "400 Bad Request", reason.c_str());

    // ENV III is an M5Stack-board feature. Switching to a Seeed or Custom board must not leave an
    // already-running I2C task behind or make the user switch back merely to reach its Disable
    // control: retire the optional sensor in the same atomic save and reboot.
    if (c.env3_enabled && !env3_board_supported(c)) c.env3_enabled = false;

    // Checks the pins against the chip AND against the X10A link in the same snapshot, so neither
    // side can steal the other's GPIO whichever endpoint is called second (logic/config_model.hpp).
    if (!board_hw_valid(c, reason, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi()))
        return send_err(req, "400 Bad Request", reason.c_str());

    // Two independent questions, and answering them with ONE comparison is what made a XIAO owner's
    // save vanish (#257): picking the preset your device already carries moves no VALUE, but it is
    // still the first time anyone stated what this board is. board_save_needed/board_reboot_needed
    // (logic/config_model.hpp, host-tested) keep them apart — persist the statement, but claim no
    // reboot for it, since no driver's pin changed.
    const bool env_changed = c.env3_enabled != cur.env3_enabled;
    if (!board_save_needed(c, cur) && !env_changed)
        return http_send_json(req, "{\"ok\":true,\"reboot\":false}");   // nothing to write, no reboot

    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    // Only the statement moved: persisted, but no driver's pin changed, so no reboot. `saved` is
    // what keeps the ANSWER honest — {"reboot":false} alone makes the UI say "no changes", which
    // would report a write to NVS as nothing having happened. Additive, so the four routes that
    // never send it keep their exact contract.
    if (!board_reboot_needed(c, cur) && !env_changed)
        return http_send_json(req, "{\"ok\":true,\"reboot\":false,\"saved\":true}");
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_env3 {enabled,sda,scl}. The I2C driver owns the bus for the life of its task, so a pin
// change is persisted and applied by reboot just like board-local hardware. Disabled is always a
// valid recovery state. Enabling is proof-gated BEFORE config_save(): SHT30 must return a CRC-valid
// measurement and QMP6988 its chip id on the selected pair. Thus a blue Save button cannot persist
// a wiring guess and reboot into a permanently unavailable sensor.
static esp_err_t set_env3(httpd_req_t* req) {
    char body[256];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    const Config cur = config();
    Config c = cur;
    c.env3_enabled = jb(j, "enabled", c.env3_enabled);
    c.env3_sda = ji(j, "sda", c.env3_sda);
    c.env3_scl = ji(j, "scl", c.env3_scl);
    cJSON_Delete(j);
    std::string reason;
    if (!env3_config_valid(c, reason, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi()))
        return send_err(req, "400 Bad Request", reason.c_str());

    switch (env3_save_check(cur, c)) {
        case Env3SaveCheck::None:
            break;  // disabling is the recovery path and must never depend on attached hardware
        case Env3SaveCheck::RunningSample: {
            const Env3Status status = env3_status();
            if (!status.connected || !status.fresh)
                return send_env3_err(req, "422 Unprocessable Entity", "env3_not_reachable",
                                     "ENV III is not currently reachable on the selected SDA/SCL pins");
            break;
        }
        case Env3SaveCheck::HardwareProbe: {
            switch (env3_probe(c.env3_sda, c.env3_scl)) {
                case Env3ProbeResult::Ok:
                    break;
                case Env3ProbeResult::BusUnavailable:
                    return send_env3_err(req, "503 Service Unavailable", "env3_probe_busy",
                                         "The I2C probe could not start; retry the save");
                case Env3ProbeResult::Sht30Unavailable:
                    return send_env3_err(req, "422 Unprocessable Entity", "env3_sht30_not_found",
                                         "ENV III temperature/humidity sensor not found on the selected pins");
                case Env3ProbeResult::Qmp6988Unavailable:
                    return send_env3_err(req, "422 Unprocessable Entity", "env3_qmp6988_not_found",
                                         "ENV III pressure sensor not found on the selected pins");
            }
            break;
        }
        case Env3SaveCheck::DisableFirst:
            return send_env3_err(req, "409 Conflict", "env3_disable_first",
                                 "Disable ENV III before changing its SDA/SCL pins");
    }

    if (c.env3_enabled == cur.env3_enabled && c.env3_sda == cur.env3_sda && c.env3_scl == cur.env3_scl)
        return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_ota {channel:"release"|"dev"} -> validate + persist, applied LIVE (no reboot).
//
// Which published feed this device follows. Since a merge to main stopped cutting a release, there
// are two: `release` (only a manual CI workflow run tags and publishes one) and `dev` (every
// firmware-relevant merge). See logic/ota_channel.hpp.
//
// No reboot, unlike /set_board: nothing claims the channel at task start — ota_update.cpp reads it
// when it fetches, so the very next check already uses the new feed. An unknown channel name is
// REJECTED rather than defaulted: answering {"ok":true} to a typo would look like a saved setting.
static esp_err_t set_ota(httpd_req_t* req) {
    char body[128];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string channel = js(j, "channel");
    cJSON_Delete(j);

    if (!ota_channel_valid(channel)) return send_err(req, "400 Bad Request", "unknown channel");

    Config c = config();
    const OtaChannel want = ota_channel_parse(channel);
    if (want == c.ota_channel) return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.ota_channel = want;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    diag_printf("ota: update channel set to %s\n", ota_channel_name(want));
    return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
}

// The web UI's manual language override. "auto" hands the choice back to the browser (the default);
// "de"/"en" force a language on every client that opens the dashboard. See logic/ui_lang.hpp.
//
// No reboot, like /set_ota: nothing claims the language at task start — the UI reads it from /status,
// so the next poll already applies it. An unknown name is REJECTED rather than defaulted: answering
// {"ok":true} to a typo would look like a saved setting.
static esp_err_t set_lang(httpd_req_t* req) {
    char body[128];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string lang = js(j, "lang");
    cJSON_Delete(j);

