0Bu/daikin-altherma-esp32/main/http_config.cpp
    if (!ui_lang_valid(lang)) return send_err(req, "400 Bad Request", "unknown language");

    Config c = config();
    const UiLang want = ui_lang_parse(lang);
    if (want == c.ui_lang) return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.ui_lang = want;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    diag_printf("ui: language set to %s\n", ui_lang_name(want));
    return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
}

// Re-run auto-detection now (without waiting for a reboot): drop back to the "auto" sentinel +
// invalidate the fingerprint, so the next poll cycle sweeps protocol + re-fingerprints the unit
// (hp_poll.cpp poll_detect). Detection state is session-only, so this is a RAM-only reset.
static esp_err_t do_detect(httpd_req_t* req) {
    Config c   = config();
    c.profile  = "auto";
    c.fp_valid = false;
    config_set_runtime(c);
    checkup_reset();
    hp_poll_reconfigure();
    // The HomeHub stack is told separately, because it IS separate: this starts or stops its task
    // and re-resolves its address without touching the X10A poll engine above.
    mb_reconfigure();
    return http_send_json(req, "{\"ok\":true}");
}

void http_register_config(httpd_handle_t s, HttpSurface surface) {
    // /set_wifi is the ONE config route the open setup AP exposes (it is how you provision the
    // network); http_register_on withholds the rest there (F01) — MQTT/syslog/NTP/HP config and
    // re-detect are trusted-LAN only, so a nearby radio client cannot reconfigure the device.
    http_register_on(s, surface, "/set_wifi", HTTP_POST, set_wifi);
    http_register_on(s, surface, "/set_mqtt", HTTP_POST, set_mqtt);
    http_register_on(s, surface, "/test_ref_temp", HTTP_POST, test_ref_temp);
    http_register_on(s, surface, "/set_ref_temp", HTTP_POST, set_ref_temp);
    http_register_on(s, surface, "/set_syslog", HTTP_POST, set_syslog);
    http_register_on(s, surface, "/set_ntp", HTTP_POST, set_ntp);
    http_register_on(s, surface, "/set_weather", HTTP_POST, set_weather);
    http_register_on(s, surface, "/set_hp", HTTP_POST, set_hp);
    http_register_on(s, surface, "/discover_homehub", HTTP_POST, discover_homehub_now);
    http_register_on(s, surface, "/set_board", HTTP_POST, set_board);
    http_register_on(s, surface, "/set_env3", HTTP_POST, set_env3);
    http_register_on(s, surface, "/set_ota", HTTP_POST, set_ota);
    http_register_on(s, surface, "/set_lang", HTTP_POST, set_lang);
    http_register_on(s, surface, "/detect", HTTP_POST, do_detect);
}

} // namespace daik
